<a href="https://colab.research.google.com/github/angelsmreyes/lab-data-cleaning/blob/master/Copy_of_main_checkpoint.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### 1. Import pandas library

In [ ]:
import pandas as pd

#### 2. Import pymysql and sqlalchemy as you have learnt in the lesson of importing/exporting data

In [ ]:
import pymysql 
from sqlalchemy import create_engine

#### 3. Create a mysql engine to set the connection to the server. Check the connection details in [this link](https://relational.fit.cvut.cz/search?tableCount%5B%5D=0-10&tableCount%5B%5D=10-30&dataType%5B%5D=Numeric&databaseSize%5B%5D=KB&databaseSize%5B%5D=MB)

In [ ]:
engine = create_engine('mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/stats')

#### 4. Import the users table

In [ ]:
df_users = pd.read_sql_query('SELECT * FROM stats.users', engine)

In [ ]:
df.head()

   userId  Reputation  ...   Age                     ProfileImageUrl
0      -1           1  ...   NaN                                None
1       2         101  ...  37.0                                None
2       3         101  ...  35.0                                None
3       4         101  ...  28.0  http://i.stack.imgur.com/d1oHX.jpg
4       5        6792  ...  35.0                                None

[5 rows x 14 columns]

#### 5. Rename Id column to userId

In [ ]:
df_users.rename(columns={'Id':'userId'}, inplace=True)

In [ ]:
df_users.head()

   userId  Reputation  ...   Age                     ProfileImageUrl
0      -1           1  ...   NaN                                None
1       2         101  ...  37.0                                None
2       3         101  ...  35.0                                None
3       4         101  ...  28.0  http://i.stack.imgur.com/d1oHX.jpg
4       5        6792  ...  35.0                                None

[5 rows x 14 columns]

#### 6. Import the posts table.

In [ ]:
df_post = pd.read_sql_query('SELECT * FROM stats.posts', engine)

In [ ]:
df_post.head()

   Id  PostTypeId  ...  OwnerDisplayName LastEditorDisplayName
0   1           1  ...              None                  None
1   2           1  ...              None                  None
2   3           1  ...              None                  None
3   4           1  ...              None                  None
4   5           2  ...              None                  None

[5 rows x 21 columns]

#### 7. Rename Id column to postId and OwnerUserId to userId

In [ ]:
df_post.rename(columns={'Id':'postId', 'OwnerUserId':'userId'}, inplace=True)

In [ ]:
df_post.head()

   postId  PostTypeId  ...  OwnerDisplayName LastEditorDisplayName
0       1           1  ...              None                  None
1       2           1  ...              None                  None
2       3           1  ...              None                  None
3       4           1  ...              None                  None
4       5           2  ...              None                  None

[5 rows x 21 columns]

#### 8. Define new dataframes for users and posts with the following selected columns:
    **users columns**: userId, Reputation,Views,UpVotes,DownVotes
    **posts columns**: postId, Score,userID,ViewCount,CommentCount

In [ ]:
users_columns = ['userId', 'Reputation', 'Views', 'UpVotes', 'DownVotes']
df_users = df_users[users_columns]
df_users.head(5)

   userId  Reputation  Views  UpVotes  DownVotes
0      -1           1      0     5007       1920
1       2         101     25        3          0
2       3         101     22       19          0
3       4         101     11        0          0
4       5        6792   1145      662          5

In [ ]:
posts_columns = ['postId', 'Score', 'userId', 'ViewCount' , 'CommentCount']
df_post = df_post[posts_columns]
df_post.head(5)

   postId  Score  userId  ViewCount  CommentCount
0       1     23     8.0     1278.0             1
1       2     22    24.0     8198.0             1
2       3     54    18.0     3613.0             4
3       4     13    23.0     5224.0             2
4       5     81    23.0        NaN             3

#### 8. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [ ]:
merge = df_post.merge(df_users, left_on='userId', right_on='userId')
merge

       postId  Score   userId  ViewCount  ...  Reputation  Views  UpVotes  DownVotes
0           1     23      8.0     1278.0  ...        6764   1089      604         25
1          16     16      8.0        NaN  ...        6764   1089      604         25
2          36     41      8.0    67396.0  ...        6764   1089      604         25
3          65     14      8.0        NaN  ...        6764   1089      604         25
4          78     33      8.0        NaN  ...        6764   1089      604         25
...       ...    ...      ...        ...  ...         ...    ...      ...        ...
90579  115366      1  55742.0       17.0  ...           6      0        0          0
90580  115370      1  55744.0       13.0  ...           6      1        0          0
90581  115371      0  35801.0       19.0  ...           1      1        0          0
90582  115375      0  49365.0        9.0  ...           1      0        0          0
90583  115376      1  55746.0        5.0  ...         106      1        0          0

[90584 rows x 9 columns]

#### 9. How many missing values do you have in your merged dataframe? On which columns?

In [ ]:
merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 90584 entries, 0 to 90583
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   postId        90584 non-null  int64
 1   Score         90584 non-null  int64
 2   userId        90584 non-null  float64
 3   ViewCount     42188 non-null  float64
 4   CommentCount  90584 non-null  int64
 5   Reputation    90584 non-null  int64
 6   Views         90584 non-null  int64
 7   UpVotes       90584 non-null  int64
 8   DownVotes     90584 non-null  int64
dtypes: float64(2), int64(7)
memory usage: 6.9 MB

In [ ]:
null_val = merge.isnull().sum()

In [ ]:
null_val[null_val > 0]

ViewCount    48396
dtype: int64

#### 10. You will need to make something with missing values.  Will you clean or filling them? Explain. 
**Remember** to check the results of your code before passing to the next step

In [ ]:
null_val_mean = merge.isnull().mean()

In [ ]:
null_val_mean[null_val_mean > 0]

ViewCount    0.534267
dtype: float64

In [ ]:
merge = merge.drop('ViewCount', axis=1)

In [ ]:
null_val = merge.isnull().sum()
null_val[null_val > 0]

Series([], dtype: int64)

In [ ]:
merge.head(5)

   postId  Score  userId  CommentCount  Reputation  Views  UpVotes  DownVotes
0       1     23     8.0             1        6764   1089      604         25
1      16     16     8.0             3        6764   1089      604         25
2      36     41     8.0             7        6764   1089      604         25
3      65     14     8.0             3        6764   1089      604         25
4      78     33     8.0             4        6764   1089      604         25

#### 11. Adjust the data types in order to avoid future issues. Which ones should be changed?

In [ ]:
merge['userId'] = merge['userId'].astype('int')

In [ ]:
merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 90584 entries, 0 to 90583
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   postId        90584 non-null  int64
 1   Score         90584 non-null  int64
 2   userId        90584 non-null  int64
 3   CommentCount  90584 non-null  int64
 4   Reputation    90584 non-null  int64
 5   Views         90584 non-null  int64
 6   UpVotes       90584 non-null  int64
 7   DownVotes     90584 non-null  int64
dtypes: int64(8)
memory usage: 6.2 MB

#### Bonus: Identify extreme values in your merged dataframe as you have learned in class, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder.